src/cf/InformationRegisters/СхемыКонфигурацийМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СхемыКонфигурацийМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СхемыКонфигурацийМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьСхему(Схема, ВерсияСервера) Экспорт
		
	НаборЗаписей = РегистрыСведений.СхемыКонфигурацийМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Версия.Установить(ВерсияСервера);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Версия = ВерсияСервера;
	НоваяЗапись.Схема = Схема;
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ПроверитьНаличиеСхемы(Версия) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СхемыКонфигурацийМП.Версия КАК Версия
		|ИЗ
		|	РегистрСведений.СхемыКонфигурацийМП КАК СхемыКонфигурацийМП
		|ГДЕ
		|	СхемыКонфигурацийМП.Версия = &Версия";
	
	Запрос.УстановитьПараметр("Версия", Версия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВерсияСхемы = ВыборкаДетальныеЗаписи.Версия;
	КонецЦикла;
	
	Если ВерсияСхемы = Неопределено Тогда
		Схема = ЭкспортXMLСхемыКонфигурации();
		Хранилище = Новый ХранилищеЗначения(Схема, Новый СжатиеДанных(9));
		ДобавитьСхему(Хранилище, Версия);
	КонецЕсли; 
	
КонецПроцедуры // ()

Функция ПолучитьСхему(Версия) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СхемыКонфигурацийМП.Версия КАК Версия,
		|	СхемыКонфигурацийМП.Схема КАК Схема
		|ИЗ
		|	РегистрСведений.СхемыКонфигурацийМП КАК СхемыКонфигурацийМП
		|ГДЕ
		|	СхемыКонфигурацийМП.Версия = &Версия";
	
	Запрос.УстановитьПараметр("Версия", Версия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Схема = ВыборкаДетальныеЗаписи.Схема;
	КонецЦикла;

	Возврат Схема
КонецФункции // ()

Функция ЭкспортXMLСхемыКонфигурации()
	
	ВыгружаемыеПакеты = Новый Массив;
	ВыгружаемыеПакеты.Добавить("http://v8.1c.ru/8.1/data/enterprise/current-config");
	
	НаборСхем = ФабрикаXDTO.ЭкспортСхемыXML(ВыгружаемыеПакеты);
	
	Схема = НаборСхем.Получить(0);
	Схема.ОбновитьЭлементDOM();
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьXMLСтрока = Новый ЗаписьXML;
	ЗаписьXMLСтрока.УстановитьСтроку();
	ЗаписьXMLФайл = Новый ЗаписьXML;
	ЗаписьDOM.Записать(Схема.ДокументDOM, ЗаписьXMLСтрока);
	ЗаписьXMLФайл.УстановитьСтроку();
	ЗаписьXMLФайл.ЗаписатьБезОбработки(ЗаписьXMLСтрока.Закрыть());
	СхемаВСтроку = ЗаписьXMLФайл.Закрыть();
	
	Возврат СхемаВСтроку;
	
КонецФункции

#КонецОбласти

#КонецЕсли
